"espk" = "Appleスピーカーポート";
"ispk" = "内蔵";
"emic" = "マイクポート";
"imic" = "内蔵";
"hdpn" = "ヘッドフォンポート";
"lini" = "オーディオライン入力ポート";
"lino" = "オーディオライン出力ポート";
"spdi" = "光デジタル入力ポート";
"spdo" = "光デジタル出力ポート";
"pci " = "PCIカード";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirMac";
"ntwk" = "ネットワークデバイス";
"blue" = "Bluetooth";
"bluh" = "Bluetoothヘッドフォン";
"blus" = "Bluetoothヘッドセット";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
